#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "6431882f64af7621924d79926a051d26" -> "d1f1995185efb78b9a5a328528fd78e0"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "eba17bedaa876461815aff38af9cdf3c" -> "71977123f81c0d0c9ca7af3b0d7768e1"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "a25acb5d65e31105d60012e14d12a4a2" -> "93ef70747ffd50f22f6688ff3af9d598"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "36d8061e19e395c08720276b0ce4f518" -> "ffee6df67d6f22901ebb54cfa2919e3d"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "f120c4c4f8483aec4a578918c374231b" -> "59a83cc392f8ecd1da5cf797cdfc0c46"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "4a2d5d94346f0b36f8869c074653ced8" -> "dcb7bb10d4d6427186805e075bde8ab6"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "f05134f92c4071046f3f2a809229d4bc" -> "035a1be6b8083c67ad9d3f8dbc14ef92"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "c24dcb33ed514b9396a02b97e1ba13a7" -> "8c7f8855f2b756636b0194cd63ae5a82"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "1dacb7da3c874aa48b9ab44ec2b167ad" -> "962cb949dd72690302a75ec849c4fc8a"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "9f0446809da4714c2528381258c0de4b" -> "2576e7a0e59786c527cf7735e18019e8"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "e31a8a84134b9be1e82b4a8fee8b7f2c" -> "c33f3eb4d70d0e8b9ab1c457c3fd68d6"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "97968caee05cbea390b63b2fbb747ba3" -> "6f62aedcdc5bc4b6cf515f662902f90d"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "2b9bcde09a7d832731c933d0e26b3ef2" -> "a1f6cd903a9738cda13e5e3764fef9d8"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "fc92b076d2fa93951b37a16b9e93175b" -> "475f1acfc0dcdb067580ed037274e0ad"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "804692e7011b8e3a2f1bef62d635a3eb" -> "d96c2856ba37445195b5f6f1fe0fcac1"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "f82acf9b749d39dc20d262de1ad930c3" -> "2e61275ce743fbab6a885f7bdf89a20e"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "928486a82ba0384126939b8604ccf97a" -> "3e90fc6c6f7dbf70d0412e6925d0edcf"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "ee550829385a3794e2b5fa42955d56d2" -> "18a451fa6f846e796f3677e075b132d1"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "e4ac811c9717bea79b0bf1dc8e881c94" -> "13ccbe3ab316c8ae4e8fbc5607af37b4"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "f800188ad1752f141eb80c84b9cb4d1b" -> "0fdbdf167796ffd332ed961eee42db5c"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "8a5f2bf25a66da5e6373788ccf6e448d" -> "af91d1d33da89b9295621986302f3c09"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "d4063c29a163810510582878b3a7df8e" -> "661278dc6d86d6508b15980e93446c45"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "4dfda2672beefc45f88eef6f5e2bfc48" -> "6ff2b34fee8ed7db6c899fcb3de7b521"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "8e71cb4b89a60ba375c377858fdc5290" -> "fa349a3d4c60d2adba08bab3b5f13340"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "dcb14723b5fc484199d1c1ad2d9dc36d" -> "3298321b6fa16b662dce00d1a8e40929"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "075c77b086e95d2d6271c49e674d9dc8" -> "1bc9205a3e35b67425b88758e5c0932a"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "50cf14fa75e3fcb2721d2950c0890d86" -> "0ff5856915c798f87376e5261d9f6943"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag               = "be0d051318471aa157c612afaa90b1c7" -> "3daf4d6452d9d19f4482fdf8c98029f2"
        id                 = "lambdas/demo/get_full_year_total_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "7679aa337cf924d1430a28eaf5d9be50" -> "87b4fb67dfd569f9e77f8b6cd245b0a8"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "a49351fe18204f308ad1cc274697fe17" -> "7b7e16eed7b6222f5c4a670aa96d1d32"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "48cbd1f4e3599b59413b07e41225121f" -> "eb0ad67b8c2baa887fcbd9ad6b4a85f5"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "decfe4b2de9307351ea672f44bee7f7c" -> "311f1ad7976734e7acca802a108aa715"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "a924036a35814b94418327f238f28b93" -> "3a9945b0b666ae1a20390a1b0d9fe780"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "26b6d7290f0f1e278d39df54342c4e5a" -> "ca4b208ec3183b1e0d6cb9edd0a7da32"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "f0370ac7fcbb2cc38041165dd33e1687" -> "a8e78c00e8bd549d24d5684b9db1afc9"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "2be272c8219dc697fb532f251f19d6ec" -> "b8fab6b2d1a95e1b23203426e0bbf1a3"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "1a46fe34158cb52a15cdc452647b8a84" -> "a95dda333bfcfdff132deeda46a90187"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "f1d3b644ee738245a8ba9a6fe209769c" -> "2c46dcbc87e9668083b50483d5d0e18d"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "0410ad73d579cb00b94b74367ce47833" -> "8a7a24f34f6f8b4d60d7c8f9d76b0172"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "d9b95dc935c62aae2ed3361643c84c99" -> "52ae23ec65702d30147d671222cfca84"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "ee9759247f5f0e8559af2c7948c39794" -> "bc8b911f5a2a5014d00c9737f79966d2"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "ed8a0b28139d35ba6424496d49e89f0e" -> "ad76e5af61696cab2956e63294b4881e"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "2a05f33a9cbadd3905e6654aafd54170" -> "b71b601cb4720d3c4cf8ac84e7ba835f"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "2495b8fd4e5474f876a4a52f558ca46f" -> "ca391353aadf75e380484b9d1e8f58cb"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "b97184d92065edf710bffb88f02df6fd" -> "bb0fdda7d3aee8613c8e9250c31be9ad"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "7737e7c7f175e50ac7fbd38620c1784c" -> "e25f6d52e0c8942fd473abef3fdf362d"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.codebuild.aws_codebuild_source_credential.git_credential must be replaced
-/+ resource "aws_codebuild_source_credential" "git_credential" {
      ~ arn         = "arn:aws:codebuild:us-west-2:435552912911:token/github" -> (known after apply)
      ~ id          = "arn:aws:codebuild:us-west-2:435552912911:token/github" -> (known after apply)
      ~ token       = (sensitive value) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "rDqb33ozX0a/Sw6hcIoDrCTXzc5payp5Atpv2KXyZMQ=" -> "4ATNB3J/Hkqjusc5aBcW+ck/FdgdjeYSmcWC0eYnT7I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "mbAWEGWXPK1Qzbl9MBClG8f9IuLMU5MXBaFBxVV9qx8=" -> "p7PlJHWSbfdI5haxTlx8lAdnTlyF0a041AoSuEdt7hk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "xwaIAUlpzlUHvV3VI2Smy9HQYSe/fXnVNxRzjvBkS4Q=" -> "gXOxAlmRfZbKlZaYkXdWe5ALVKF3JcAhPgcpNvMLjzQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "INKhUfDYNqVQAAhOBqCBNED0hpKWScsamuKzMH7Nd/Q=" -> "kfjIx33jMiU7V/euvP9FGTOlAZDYQvJzPR36LMKpcdc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "afctkexUfsgHYiDaWJDsC3KE978+36qaOTYp5NI4vyI=" -> "CNOX+vRxLngtmw9sXtS7APVoZszLLj9sFZTSIXaL3S4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "1kn+whYSweQQ9j9cZiGtG4EjX0qqmfIqnDcsZZ6KSrw=" -> "8Ibjl0bEMdBC8Bbe4LJPmYVP19pI/1fMBIu+Uf16zwg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "vIxf+oxAmgpVcbH16yvUN0K59zRnlnAiWYQVP+Uj0IY=" -> "/9fFcUI/C+twEscnSKzvxrYTicY6d/LFZz2VTvBFRXE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "TmjynSuJ0e5z1RPqiA5dxKzmSmaB2CWWpcTphI4R87Y=" -> "T7I8X1BdRkvPiaQtHxlWYQ/rHv5jpThWxt++x/ulJSA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "dRhMhzMniHq3kH4bXJj17s+lq1OImy/fYcfJCol50WA=" -> "B4WCrUs7c6xsJJqT/GzLt1z6Z/GHtgtF5fFYd2TCN6k="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "EqLDsYq6AZT44NZKMdgB6u9+ShiTDSYxbasBowVzO3Q=" -> "5neRe5zQ+t+NgY9WpGNQSuyHemUqRwXQFX82oMSYe7M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "ag+xYDGqm2uyUz7JBj31hSYBHu7MEda07lgV/HXZwJs=" -> "7Blv/KtlbopvGCxZfMvDXQsE5REbTH4iiQgtOw1BGp8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "X0pPP9d1LHtaf5uTbfvv4Xc0oRU3tqQJzPjuP5ucuTk=" -> "uDnbmMeW3ubKrZiy7vQhKr64kLKRpgglYg4YX8lH5aY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZrZLB2tv1SQirIarirzWbZPulRQ9195aSWhnV0vKZTk=" -> "MI5uFveT+tCJIedazdWg7eoknRlgWhKImeJHMM4pQyI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "DBG3FKZeKOJNdotKGhMhLRIgEOSSebrIN9AKZ6WbFO0=" -> "LBatIr+kKt/YLyIaui/UBfDqmQR0+7mmzS9wf1eyQqM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "AIuZ3GlgbUGQOZZwHFYmLIPRS1QnVNdnSbjFPkOs5zU=" -> "+a+i2BFlerMZ1PhcNmTW0PpTc4kbXh7eRGDCt1QjePg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "S+okPOHrzOngmtnSwIoYeBKG84t7hyDroAi/80vIgeg=" -> "FzCbtxyKMJvtiFdUagBMeQ8v1oGXb0sSF3zv0UnQuwo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "5oMZcVJyOyOD2zoQmcoJYb41M8yYJUiWLBBA6pV4afg=" -> "OWjmmmPsAYVu2kd8JMrVIUn+aoT0FpkHUl8I+RxHEYk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "/A6L2fMHKv7z23dMdVyXsaBAahkTj5l3QGrkpY9/jJs=" -> "FJUBxmB+RvitlenI+wwlVGlQMKa3ZWmlCoHjKPAsHj4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "lDHvcQKKxxGCD500FwItTiT67IoGUCE6VcmT1ozVomE=" -> "fGinxDbLxhcy2oWI7A7sz0eLfCYThW4/X0pF/eh6rZs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "392AfyCbuTJxG298SnNnt2UV0/X0hIxXaFy65JdkW6c=" -> "6f8GzKHFs8U/lin/5InKbdkG9062tEQtLrQKZoVzCD0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-01-11T02:15:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "/BEvbsG30GDrfGtUZ8Gh/+kbHow41RYHe4SFzySnBT8=" -> "HRaprIjPOZm1vUGiOK+pSpC68JKWSKbDRm8wur+M0Y4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "rvQUmMqhyBPlIVyoYDaLu4YKoa+81AR9sdfAQiUUGII=" -> "c6EdUHQt8f/WvDkeNyxx+JO3x9K/r8pajM4lobgqT6w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "O9w/C8nigSd/KvU+eUfcGYp1RW96eyiV9J3VZSHB8G0=" -> "xuJOKWbGB1nBDFBn4rauLmQUcfkU+zp1onplsnnYAL8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "y8qy26iTY4maHlXOtP2uC+vAIHfSzWMSpRlp/Yl/FZ0=" -> "MyXoVnTrc3ygILdkq0OP9GVrT6TdEADoensYz7mYGJE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "+7RQk09Ld1OwdeP6Sx41zG9wPnp3blLKFW6rW13fD94=" -> "kDg9t0t2KbbSrTQYQKVgH5XC1lBb3M6gvi1ntf32jOI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "hbaI97J7SwZ3F1oAxQHAkydCNOsceqTGWjyya8tDBzI=" -> "/57pvKO+moNQfg/EXcog0oKIeu0P2d65tzVjijxJIfI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "fLa1w7DbEy0DV8A6xS5s/CfIZCBUOPZBm+JXRMch8so=" -> "ZdhnC4AdV01hRNSal8di0Bl/5YFyLnBAVfFRB95Lr2o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "f1BFU6lDakX/t9KxofgTVFKXJ44JzQz79fudbEr0twk=" -> "X1NJVx+VSzUTtpQtx3XJG77fqY+d9aNldKzVNbEbu14="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "LptOGTlp2yo+TeDeTzxYMjCOifoyIszBqWjw+wfNlvY=" -> "gYWAnQ/xZGpXLd7T4wF9TbDJ1yiJ9QVmMFgpLTqc/5g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "wTbNy/cJislrvDDrGkvOCMn7kmvXQKe4gz/ZC9np+2A=" -> "m/DDeBKKcQ5fMhVoXmlbI0r3jymid2nf+JY3q3nF+wE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "I4kixPMWiYBXzvGDF2iyndwWG1Z4xjAZgFPg+ZDKSb4=" -> "1N5bK7scN2VDE1fgqMku6k1V2UU3mBYKAYsGyHyXb18="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "IZ3AdwM4GCv34fPNKZmutCZl66mfuPD8h9n73/JNrYw=" -> "DH9B44wgQX+IGT6gSeJNi+YAA1QJEETwVtPVFeDwOYU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "KwUVEhsR5asJcHnUrYjWtMlS71T7ZPILZpeH8bf/17I=" -> "9SS13okJVNIUd2zgCoGteEmHngYdKyC/S5zf+NNVpqE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "v23u/BjasWbXWFsbe6GMgfZTPxxnF1phohW5k62rWSs=" -> "0Q2Aq2b+7WfZ/7oHXukd4asufxrRYPZSTRQPxKGn+4I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "Q3anz468Y1zvkSoFRJkZvW3MRJ7Zq0ycqcp6NgkGhSQ=" -> "Svv2obXnnCEJWzugwwws/nrBefqcjH+9FH/wK/Y93F4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "SdNV7Jex3TSTjQ0uGLsOfHOLzF6qs27OFRAKqi/3/Bg=" -> "LUKw0rzwECI+dY4MyfGNcnV7ZHQ/kDvbguY+iftClac="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "da0LjGCf2dHubVQXiIWmVPzC6d/el0zqIhvW/NJ6Xgo=" -> "RdhF7qMQZ28ziCTNtueA3ybxxT9Zm27C6vzBzyGljRU="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "WiwCd7SKsIP/Spc5urB0c8PxWzPGvkuNK7oJemB5yPk=" -> "jOZJNyCsDaf3CXXg/YmxvdJMd88/YDip8W/XiiEVM9Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "4URzcW7IcsfkHvXH9DIl5X2kjUSwraVAWGCDPSfkCj0=" -> "Vre/bfsUxgBrEqMGoS2VtfF3PpveJtlffY0xTabZLl8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "MG4JqipdQyi8Yy0qxhPVpD995ZAQ43I9ESShTatKV8E=" -> "kUuKJ1Vllt0a3APGF7cnYkRMDEwCOmyK46n7eoiHiBA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "6Bt4IRY6A75WjxGDs+ejwLoR5PMfVDIoSWhcBs89OwI=" -> "vk2v03zPnYOSeOV2uuigmswYXXCTSXlAyGy0k6iUxs4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "IoojPLlydtJb6kTypZEzBDVHL8VgygComOd0A6NfeLY=" -> "VKWGbSUuFzwClBQuNYoEHy1XeX6SJDs7pzWxuyDqkAQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "1TP/Ao2lorYEvSKWGKW8LGXwMgyG046k0jCgo/Xw6Oc=" -> "YtV8Tb+lZNi85ysk/CHfSllvPZnGMBf5KzEPuKc+/Ak="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "k+2xccoXn6njJZccO7526JZWoFQ1B3pj/KZ5D74dWbo=" -> "iHNOKgQPrf73OMMDUOdWZMQ9TqyminpnjXPTSRnQO10="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "l05RXpzxMjqFE2BanWDkseuknsxSCL+xkVJ7JWIBGhg=" -> "XwPYD8bHw4KlfemFc6cqpHVHF/qq6JL6NY+ujsu3q+M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-01-09T18:28:05Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "9e0q7u" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-01-09T18:28:02Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-01-09T18:28:02Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 93 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*